

#

#

#


# 1. מה מבצע הקוד המופיע בתמונה? כמה פעמים יודפס K*5 ומה יודפס בכל פעם?
# שורת קוד זאת קופצת מ0 עד40 בקפיצות של 5
x = 4
y = 5
for k in range(x+y):
    print(k*5)
print("\n")


# 2. כתבו תכנית המדפיסה את כל המספרים בין 200 ל-400.
for i in range(200,401):
    print(i)
print("\n")

# 3. כתבו תכנית המדפיסה את כל המספרים האי-זוגיים בין 2 ל-200.
for i in range(3,200,2):
    print(i)
print("\n")

# 4. כתבו תכנית המדפיסה את כל המספרים בין 10 ל- -6 (מינוס שש) בסדר יורד.
for i in range(10,-6,-1):
    print(i)
