# 1.יוסי וליאת עורכים בדיקה כמה חניכים הגיעו לפעולת אמצע שבוע בתנועת הנוער.
# כתבו קטע קוד הקולט את מס' החניכים עבור פעולת אמצע שבוע
# במידה והגיעו יותר מ-30 חניכים -  יודפס "אתם מדריכים מעולים"
# במידה והגיעו בין 20 ל-30 חניכים – יודפס "מס' החניכים הכי גדול בסניף"
# במידה והגיעו בין 10 ל- 20 חניכים – יודפס "מס' סביר של חניכים"
# במידה והגיעו פחות מ-10 חניכים – יודפס "יש לגייס דחוף חניכים לשבט"
# בכל מקרה ללא קשר למס' החניכים יודפס בסוף – "תנועת נוער - למימוש החזון של יצירת חברה לומדת ועושה"

#
# 2. איתמר ויעל לומדים צבעים. כתבו קטע קוד שיעזור להם.
# קלוט צבע למשתנה color
# אם הצבוע הוא yellow– יודפס צהוב
# אם הצבוע הוא red– יודפס אדום
# אם הצבוע הוא  blue– יודפס כחול
# בכל מקרה אחר יודפס– עדיין לא למדנו צבע זה
# בכל מקרה (ללא קשר לצבע שנקלט) יודפס "צבעים מזינים את נפש האדם ומעניקים לו תמיד שמחה ותקווה"
#
#
# 3. כביש אגרה (כביש שהנסיעה בו כרוכה בתשלום) מחולק לקטעים. מחיר הנסיעה בכל קטע הוא 30 שקלים.
# נהג שעובר בכביש יותר מ־ 8 קטעים, מקבל הנחה של 10 שקלים מהסכום הכולל.
# כתוב תכנית שתקלוט שם של נהג ואת מספר הקטעים שעבר בכביש האגרה. התכנית תדפיס את שם הנהג ואת הסכום שעליו לשלם.
#
#
# שימו לב:
# - בתרגיל 2, מכיוון שאנו קולטים טקסט ולא מספר, אין צורך לבצע המרה ל- INT אלא פשוט לקלוט את הטקסט כמו שהוא.
# הדבר נכון גם עבור שם הנהג בתרגיל 3.
# - כתבו את שלושת התרגילים בקובץ אחד ושלחו לי את הקובץ בו עבדתם, לא קובץ וורד אליו אתם מעתיקים את הקוד ולא 3 קבצים נפרדים.

# משימה 1
campers = int(input("enter a number: "))

if campers > 30:
    print(" אתם מדריכים מעולים")
elif campers <= 30 and campers > 20:
    print("מספר החניכים הגדול ביותר בסניף")
elif campers <= 20 and campers > 10:
    print("מספר חניכים סביר")
elif campers <= 10:
    print("יש לגייס עוד חניכים ")
print("תנועת נוער - למימוש חזון של יצירת חברה לומדת ועושה")


#משימה 2
color = input("chose a color: ")

if color == "yellow":
    print("צהוב")
elif color == "red":
    print("אדום")
elif color == "blue":
    print("כחול")
else:
    print(" עדיין לא למדנו צבע זה")
print("צבעים מזינים את נפש האדם ומעניקים לו תמיד שמחה ותקווה")

# משימה 3
name = input("enter a name: ")
times_here = int(input("enter a number: "))
pay = times_here * 30

if times_here > 8:
    pay -= 10
print(name ,"needs to pay", pay,"NIS")
